# **Nomor 3**
File Credit.csv memuat 11 atribut yang terdiri dari 7 atribut bertipe kontinyu: balance (rata-rata tunggakan kartu kredit), age, cards (jumlah kartu kredit), education (lama sekolah), income (dalam dollars), limit (batas kredit), dan rating (rating kredit), dan 4 atribut bertipe diskrit: gender, student (status mahasiswa), status (status perkawinan), and ethnicity (etnis).

In [0]:
import pandas as pd
from sklearn.naive_bayes import GaussianNB
from sklearn import svm
from sklearn.model_selection import train_test_split
from sklearn.metrics import confusion_matrix
from sklearn import preprocessing
from sklearn.model_selection import cross_val_score
import numpy as np
from sklearn.feature_selection import SelectKBest, chi2
from sklearn.ensemble import RandomForestClassifier
from sklearn.tree import export_graphviz
import pydot

In [0]:
dfc = pd.read_csv('/content/drive/My Drive/Data Science/Credit.csv')
dfc = dfc.drop(['Unnamed: 0'], axis=1)
dfc.head()

    Income  Limit  Rating  Cards  ...  Student  Married  Ethnicity Balance
0   14.891   3606     283      2  ...       No      Yes  Caucasian     333
1  106.025   6645     483      3  ...      Yes      Yes      Asian     903
2  104.593   7075     514      4  ...       No       No      Asian     580
3  148.924   9504     681      3  ...       No       No      Asian     964
4   55.882   4897     357      2  ...       No      Yes  Caucasian     331

[5 rows x 11 columns]

## a. 
Hitung nilai minimum, maximum, rata-rata, standar deviasi dari atribut Limit

In [0]:
print("Limit :")
print('Min \t\t: ', dfc['Limit'].min())
print('Max \t\t: ', dfc['Limit'].max())
print('Mean \t\t: ', dfc['Limit'].mean())
print('Standar deviasi\t: ', dfc['Limit'].std())

Limit :
Min 		:  855
Max 		:  13913
Mean 		:  4735.6
Standar deviasi	:  2308.1988475431426

## b. 
Hitung nilai modus, median, inter-quartile range dari atribut Limit.

In [0]:
print("Limit :")
modes = dfc['Limit'].mode()
for n,mode in enumerate(modes):
  print('Mode ',n+1,'\t: ',mode )
  
print('Median \t\t: ', dfc['Limit'].median())

limit = dfc['Limit'].values
iqr = np.subtract(*np.percentile(limit, [75, 25]))
print('IQR \t\t: ', iqr)

Limit :
Mode  1 	:  855
Mode  2 	:  2120
Mode  3 	:  2525
Mode  4 	:  2860
Mode  5 	:  3388
Mode  6 	:  3461
Mode  7 	:  3907
Mode  8 	:  4391
Mode  9 	:  5140
Mode  10 	:  5673
Mode  11 	:  6386
Mode  12 	:  6662
Mode  13 	:  6819
Median 		:  4622.5
IQR 		:  2784.75

## c. 
Hitung rata-rata tunggakan (Balance) orang Asia.

In [0]:
dfc_asian = dfc[(dfc.Ethnicity == 'Asian')]
display(dfc_asian.groupby(['Ethnicity'])['Balance'].mean().reset_index())

  Ethnicity     Balance
0     Asian  512.313725

## d. 
Tentukan koefisien korelasi atribut Income dan Age dengan atribut Balance. Atribut manakah yang lebih berpengaruh pada atribut Balance? Berikan alasannya

In [0]:
print("Corr Income and Balance :", dfc['Income'].corr(dfc['Balance']))
print("Corr Age and Balance :", dfc['Age'].corr(dfc['Balance']))

Corr Income and Balance : 0.4636564570157573
Corr Age and Balance : 0.0018351188590736576

**Income lebih berpengaruh**, Alasan : keduanya Income dan age memiliki correlasi positive terhadapa Balance tetapai income memiliki nilai correlasi yang lebih besar, sehingga dapat disimpulkan Income memiliki pengaruh lebih besar dari pada age terhadapa balance

## e. 
Misalkan nilai atribut Cards dari pelanggan ke-1 kosong (missing value), diisi dengan nilai berapakah nilai kosong tersebut?

In [0]:
print('Mean Card : ',round(dfc['Cards'].mean()))

Mean Card :  3

Pada nilai Card pelanggan ke-1 bisa diisi dengan rerata dari semua niali cards **yaitu 3**

## f. 
Tentukan nilai Age dari pelanggan ke-2 jika atribut Age dinormalisasi menggunakan min-max.

In [0]:
min_max_scaler = preprocessing.MinMaxScaler()
ages = dfc[["Age"]]
ages_normalize = min_max_scaler.fit_transform(ages)
ages_normalize[:5]

array([[0.147],
       [0.787],
       [0.64 ],
       [0.173],
       [0.6  ]])

Age dari pelanggan ke-2 setelah minmax normalize adalah **0.78666667**

## g. 
Lakukan diskritisasi pada atribut Age menjadi 3 kategori umur, yaitu muda = [20, 35], sedang = [36, 55], tua = [56, 100]. Tentukan jumlah pelanggan pada masing-masing ketegori usia

In [0]:
bins = [20, 36, 56, 100]

labels = ['Muda', 'Sedang', 'Tua']
dfc['Age_cat'] = pd.cut(dfc.Age, bins, labels = labels,include_lowest = True)
dfc.head()

    Income  Limit  Rating  Cards  ...  Married  Ethnicity Balance Age_cat
0   14.891   3606     283      2  ...      Yes  Caucasian     333    Muda
1  106.025   6645     483      3  ...      Yes      Asian     903     Tua
2  104.593   7075     514      4  ...       No      Asian     580     Tua
3  148.924   9504     681      3  ...       No      Asian     964    Muda
4   55.882   4897     357      2  ...      Yes  Caucasian     331     Tua

[5 rows x 12 columns]

In [0]:
dfc.groupby('Age_cat').Age_cat.agg('count')

Age_cat
Muda       67
Sedang    139
Tua       194
Name: Age_cat, dtype: int64

# Nomor 4

In [0]:
df = pd.read_csv('/content/drive/My Drive/Data Science/bank-data.csv')
df.head()

        id  age     sex      region  ...  save_act current_act  mortgage  pep
0  ID12101   48  FEMALE  INNER_CITY  ...        NO          NO        NO  YES
1  ID12102   40    MALE        TOWN  ...        NO         YES       YES   NO
2  ID12103   51  FEMALE  INNER_CITY  ...       YES         YES        NO   NO
3  ID12104   23  FEMALE        TOWN  ...        NO         YES        NO   NO
4  ID12105   57  FEMALE       RURAL  ...       YES          NO        NO   NO

[5 rows x 12 columns]

## Preprocessing

In [0]:
df_pre = df
le = preprocessing.LabelEncoder() 
# ubah colomn bernilai categorical menjadi numerik
cat_col = ['sex','married', 'car', 'save_act', 'current_act','mortgage','pep']
df_pre[cat_col] = df_pre[cat_col].apply(lambda col: le.fit_transform(col))
df_pre.head(10)

        id  age  sex      region  ...  save_act  current_act  mortgage  pep
0  ID12101   48    0  INNER_CITY  ...         0            0         0    1
1  ID12102   40    1        TOWN  ...         0            1         1    0
2  ID12103   51    0  INNER_CITY  ...         1            1         0    0
3  ID12104   23    0        TOWN  ...         0            1         0    0
4  ID12105   57    0       RURAL  ...         1            0         0    0
5  ID12106   57    0        TOWN  ...         1            1         0    1
6  ID12107   22    1       RURAL  ...         0            1         0    1
7  ID12108   58    1        TOWN  ...         1            1         0    0
8  ID12109   37    0    SUBURBAN  ...         0            0         0    0
9  ID12110   54    1        TOWN  ...         1            1         0    0

[10 rows x 12 columns]

In [0]:
# creating instance of one-hot-encoder
enc = preprocessing.OneHotEncoder(handle_unknown='ignore')
# passing bridge-types-cat column (label encoded values of bridge_types)
enc_df = pd.DataFrame(enc.fit_transform(df_pre[['region']]).toarray())
# merge with main df bridge_df on key values
df_pre = df_pre.join(enc_df)
df_pre.head()

        id  age  sex      region   income  ...  pep    0    1    2    3
0  ID12101   48    0  INNER_CITY  17546.0  ...    1  1.0  0.0  0.0  0.0
1  ID12102   40    1        TOWN  30085.1  ...    0  0.0  0.0  0.0  1.0
2  ID12103   51    0  INNER_CITY  16575.4  ...    0  1.0  0.0  0.0  0.0
3  ID12104   23    0        TOWN  20375.4  ...    0  0.0  0.0  0.0  1.0
4  ID12105   57    0       RURAL  50576.3  ...    0  0.0  1.0  0.0  0.0

[5 rows x 16 columns]

In [0]:
df_pre = df_pre.drop(['id','region'], axis = 1) # drop colomn id yang tidak di perlukan
df_pre.head()

   age  sex   income  married  children  car  ...  mortgage  pep    0    1    2    3
0   48    0  17546.0        0         1    0  ...         0    1  1.0  0.0  0.0  0.0
1   40    1  30085.1        1         3    1  ...         1    0  0.0  0.0  0.0  1.0
2   51    0  16575.4        1         0    1  ...         0    0  1.0  0.0  0.0  0.0
3   23    0  20375.4        1         3    0  ...         0    0  0.0  0.0  0.0  1.0
4   57    0  50576.3        1         0    0  ...         0    0  0.0  1.0  0.0  0.0

[5 rows x 14 columns]

In [0]:
# Melakukan normalisai pada colomn age dan income
min_max_scaler = preprocessing.MinMaxScaler()
df_pre['age'] = min_max_scaler.fit_transform(df_pre[["age"]])
df_pre['income'] = min_max_scaler.fit_transform(df_pre[["income"]])
df_pre.head()

        age  sex    income  married  children  ...  pep    0    1    2    3
0  0.612245    0  0.215634        0         1  ...    1  1.0  0.0  0.0  0.0
1  0.448980    1  0.431395        1         3  ...    0  0.0  0.0  0.0  1.0
2  0.673469    0  0.198933        1         0  ...    0  1.0  0.0  0.0  0.0
3  0.102041    0  0.264320        1         3  ...    0  0.0  0.0  0.0  1.0
4  0.795918    0  0.783987        1         0  ...    0  0.0  1.0  0.0  0.0

[5 rows x 14 columns]

In [0]:
# Split data fitur ke var X dan data target ke var y
X = df_pre.drop(['pep'], axis=1) 
y = df_pre['pep']

# Split data menjadi data training dan data testing
X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=4)

## a. 
Menggunakan algoritma Naïve-Bayes, SVM, dan Random Forest, serta 10-fold Crossvalidation, buat 3 model menggunakan data tersebut. Tentukan algoritma yang paling
bagus kinerjanya dan beri alasannya.

### Naïve-Bayes

In [0]:
modelNB = GaussianNB()

modelNB.fit(X_train, y_train)
y_pred_nb = modelNB.predict(X_test)

print('accuracy: ', modelNB.score(X_test, y_test))

accuracy:  0.6266666666666667

In [0]:
# 10 Fold Cross Validation
scores = cross_val_score(modelNB, X, y, cv=10, scoring='accuracy')

for n,score in enumerate(scores):
  print("iter ke ",n,"Acc : ",score)
print("\nMean acc :",scores.mean())

iter ke  0 Acc :  0.6666666666666666
iter ke  1 Acc :  0.5833333333333334
iter ke  2 Acc :  0.5666666666666667
iter ke  3 Acc :  0.6333333333333333
iter ke  4 Acc :  0.7
iter ke  5 Acc :  0.6166666666666667
iter ke  6 Acc :  0.6833333333333333
iter ke  7 Acc :  0.55
iter ke  8 Acc :  0.7166666666666667
iter ke  9 Acc :  0.6

Mean acc : 0.6316666666666666

### SVM

In [0]:
modelSVM = svm.SVC(gamma='scale')

modelSVM.fit(X_train, y_train)
y_pred_svm = modelSVM.predict(X_test)

print('accuracy: ', modelSVM.score(X_test, y_test))

accuracy:  0.8

In [0]:
# 10 Fold Cross Validation
scores = cross_val_score(modelSVM, X, y, cv=10, scoring='accuracy')

for n,score in enumerate(scores):
  print("iter ke ",n,"Acc : ",score)
print("\nMean acc :",scores.mean())

iter ke  0 Acc :  0.8166666666666667
iter ke  1 Acc :  0.8
iter ke  2 Acc :  0.85
iter ke  3 Acc :  0.85
iter ke  4 Acc :  0.9
iter ke  5 Acc :  0.8333333333333334
iter ke  6 Acc :  0.85
iter ke  7 Acc :  0.7666666666666667
iter ke  8 Acc :  0.8333333333333334
iter ke  9 Acc :  0.8166666666666667

Mean acc : 0.8316666666666667

## Random Forrest

In [0]:
modelrf = RandomForestClassifier(n_estimators=100, 
                               bootstrap = True,
                               max_features = 'sqrt')

modelrf.fit(X_train, y_train)
y_pred_rf = modelrf.predict(X_test)

print('accuracy: ', modelrf.score(X_test, y_test))

accuracy:  0.8133333333333334

In [0]:
# 10 Fold Cross Validation
scores = cross_val_score(modelrf, X, y, cv=10, scoring='accuracy')

for n,score in enumerate(scores):
  print("iter ke ",n,"Acc : ",score)
print("\nMean acc :",scores.mean())

iter ke  0 Acc :  0.9
iter ke  1 Acc :  0.8666666666666667
iter ke  2 Acc :  0.8833333333333333
iter ke  3 Acc :  0.8333333333333334
iter ke  4 Acc :  0.9166666666666666
iter ke  5 Acc :  0.8666666666666667
iter ke  6 Acc :  0.8833333333333333
iter ke  7 Acc :  0.7833333333333333
iter ke  8 Acc :  0.85
iter ke  9 Acc :  0.8166666666666667

Mean acc : 0.86

## b. 
Berdasarkan model terbaik pada (a), tunjukan confusion matrix yang dihasilkan dan
hitung nilai precision, recall, dan f-measure secara manual.

In [0]:
# Hasil terbaik pada soal a adalah SVM maka menggunakan hasil presiksi dari svm
# yaitu y_pred_svm
# Confusion matrix Data Testing
cm = confusion_matrix(y_test, y_pred_rf)
print(cm)
TP = cm[0][0]
FP = cm[0][1]
FN = cm[1][0]
TN = cm[1][1]
print("\nTP :"+str(TP),"FP :"+str(FP),"FN :"+str(FN),"TN :"+str(TN))

[[74  7]
 [21 48]]

TP :74 FP :7 FN :21 TN :48

In [0]:
Precision = TP / (TP + FP)
Recall = TP / (TP + FN)
FMeasure = (2 * Precision * Recall) / (Precision + Recall)

print('Precision\t: ',Precision)
print('Recall\t\t: ',Recall)
print('F-Measure\t: ',FMeasure)

Precision	:  0.9135802469135802
Recall		:  0.7789473684210526
F-Measure	:  0.8409090909090909

## c. 
Pilih 3 atribut pertama yang paling berpengaruh pada atribut pep. Note: soal (c) adalah tentang feature selection.

In [0]:
# Feature extraction dengan chi square
test = SelectKBest(score_func=chi2, k=3)
fit = test.fit(X, y)

# Menampilkan hasil scores
np.set_printoptions(precision=3)
print(fit.scores_)

features = fit.transform(X)
# Menampilkan features terpilih
print(features[0:10,:])

[3.151e+00 6.583e-01 3.755e+00 7.332e+00 2.199e+00 1.088e-01 9.852e-01
 9.165e-02 2.286e-01 3.677e-04 1.959e-01 2.102e+00 1.492e+00]
[[0.612 0.216 0.   ]
 [0.449 0.431 1.   ]
 [0.673 0.199 1.   ]
 [0.102 0.264 1.   ]
 [0.796 0.784 1.   ]
 [0.796 0.565 1.   ]
 [0.082 0.066 0.   ]
 [0.816 0.343 1.   ]
 [0.388 0.349 1.   ]
 [0.735 0.33  1.   ]]

Berdasarakan Feature Selection yang dilakukan maka dapat disimpulkan 3 Best Feature adalah : 
*  **age** 
*  **income**
*  **married**